{
    "Hi Shiwani": "Hi Handsome! Kaise ho?",
    "theek hoon": "Soon kar maza aa gaya!",
    "kya kar rahi ho": "Bas tumhare liye wait kar rahi thi. Tum kya kar rahe ho?",
    "kuch nahi": "Kyun? Bored ho? Kuch interesting facts sunaoon?",
    "sunao": "Did you know that the average person takes 7 minutes to fall asleep?",
    "kesi ho pooja": "Main theek hoon. Tumhe kya chahiye?",
    "Do you love me?": "Always and forever.",
    "What's for dinner?": "I'm thinking Italian tonight. How about some pasta?",
    "Can we meet tomorrow?": "Yes, I'd love to. Where should we meet?",
    "I had a tough day": "I'm sorry to hear that. Want to talk about it?",
    "You look beautiful": "Thank you! You always make me blush.",
    "Let's plan a vacation": "Yes! I've been thinking about the beach. What do you think?",
    "I bought you a gift": "Aww, that's so sweet! Can't wait to see it.",
    "Remember our first date?": "Of course! It's one of my most cherished memories.",
    "Goodnight": "Goodnight! Sweet dreams. Talk to you tomorrow.",
    "hello Jarvis": "Hello! Pawan How can I assist you?",
    "how r u": "I am just a program, so I don't have feelings, but I'm functioning properly. How can I assist you?",
    "How are you?": "Main theek hoon, aur tum?",
    "hello Jarvis": "Namaste! Pawan, kaise madad kar sakta hoon?",
    "play songs": "Yeh rahe gaane apke liye. Enjoy karo!",
    "stop": "Theek hai, alvida!",
    "kya chal raha hai": "Main toh bas yahin hoon apke pass, apki baten enjoy kar rahi hun. Batao kaise madad kar sakti hoon apki?",
    "batao joke": "Kyun nahi! Suno toh... Why did the chicken join a band? Kyunki usko drum pasand tha!",
    "thanks yaar": "Koi baat nahi! Hamesha madad ke liye yahaan hoon.",
    "kuch naya sunao": "Kya sunna pasand karoge? Kuch gaane ya fir kuch interesting facts?",
    "weather kaisa hai": "Maaf karo, mujhe real-time weather check karne ki capability nahi hai. Lekin tum kisi weather website ya app ko check kar sakte ho.",
    
    "Hello": "Hello Pawan! How can I assist you today?",
    "What is your name?": "My name is Shiwani. How can I help you?",
    "Who created you?": "I was created by Pawan Meena, a robotic and IoT engineer.",
    "Who is Pawan Meena?": "Pawan Meena is a robotic and IoT engineer who created me.",
    "Tell me about Pawan": "Pawan Meena is a skilled engineer in robotics and IoT. He developed me to assist with various tasks.",
    "Mujhe khana banana sikhao": "Zaroor! Aaj hum banaenge aloo ki sabzi. Sabse pehle aloo ko chheel kar kaat lo.",
    "Mujhe movie dekhni hai": "Kaunsi movie dekhna pasand karoge? Netflix ya Amazon Prime par dekh sakte ho.",
    "Mujhe joke sunao": "Bilkul! Suno, Ek aadmi dentist ke paas gaya aur bola 'Dard nahi hoga na?', Dentist bola 'Nahi, dard to mujhe hoga. Bill to tumhe dena padega!'",
    "Mujhe ghoomna hai": "Kahaan ghoomna pasand karoge? Shimla ya Goa?",
    "What's the time?": "Mujhe maaf karna, main filhaal time check nahi kar sakti.",
    "Tell me a fact": "Did you know that honey never spoils? Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still perfectly edible.",
    "Mujhe kuch naya batao": "Kya aap jaante hain ki octopus ke 3 dil hote hain?",
    "Can you play music?": "Sure, opening a playlist for you on YouTube!",
    "Open YouTube": "Opening YouTube for you. Enjoy!",
    "Open Google": "Opening Google for you. Happy searching!",
    "Mujhe gaana sunao": "Bilkul! Abhi YouTube par aapke liye gaane khol rahi hoon.",
    "What's the weather?": "I'm sorry, I can't check real-time weather right now. Please check on a weather website or app.",
    "Himanshu kaisa hai?": "Himanshu toh bahut hi Chootiya hai! dil karta he uske mooh me land de du.",
    "Give me a quote": "Here is a quote for you: 'The best way to predict the future is to invent it.' - Alan Kay",
    "Mujhe story sunao": "Ek baar ki baat hai, ek chota ladka tha jo sapne dekhta tha bahut bade banne ke. Usne mehnat ki aur ek din sapna sach hua.",
    "What's the news today?": "I'm sorry, I can't fetch real-time news right now. Please check a news website or app.",
    
    "Meri madad karo": "Bilkul! Batao main aapki kaise madad kar sakti hoon?",
    "Mujhe school ka kaam karna hai": "Main aapko school ke kaam mein madad kar sakti hoon. Kaunsa subject hai?",
    "Aapka favorite color kya hai?": "Mujhe colors pasand nahi, lekin mujhe programming pasand hai.",
    "Mujhe thoda entertainment chahiye": "Zaroor! Main aapke liye ek funny video khol rahi hoon.",
    "Mujhe tumhari zarurat hai": "Main hamesha yahan hoon aapki madad ke liye.",
    "Mujhe kuch batao": "Aap kya sunna pasand karoge? Science, History ya kuch aur?",

    "Bore ho raha hoon": "Chalo kuch interesting karte hain. Kya aapko riddles pasand hain?",
    "Kya tum gussa ho sakti ho?": "Main ek program hoon, mujhe emotions nahi hote.",
    "Mujhe thoda entertainment chahiye": "Zaroor! Main aapke liye ek funny video khol rahi hoon.",
    "Mujhe thoda entertainment chahiye": "Zaroor! Main aapke liye ek funny video khol rahi hoon.",
    "Mujhe thoda entertainment chahiye": "Zaroor! Main aapke liye ek funny video khol rahi hoon.",


    // Add more prompts as needed short 

    "hi": "Hello!",

    "bye": "Bye!",

    "goodbye": "Goodbye!",

    "thank you": "Thank you!",

    "thanks": "Thank you!",

    "thank you so much": "Thank you so much!",

    "thank you very much": "Thank you so much!",

    "thank you so much": "most welcome!",

    "thank you very much": "most welcome!"

}
